/*
https://developer.mozilla.org/ru/docs/Glossary/AJAX
Асинхронный JavaScript и XML (Ajax или AJAX) — это подход к разработке, при котором веб-приложения запрашивают данные с сервера с помощью асинхронных HTTP-запросов и обновляют только необходимые части документа, без полной перезагрузки страницы. Это может сделать страницу более отзывчивой, потому что запрашиваются только необходимые для обновления части.
*/

// Иногда приходится встречаться с легаси проектами и нужно понимать что происходит

const url = 'https://jsonplaceholder.typicode.com/posts/1'

// Некий специальный объект, который мы должны настроить
const request = new XMLHttpRequest()

// Открываем запрос к серверу на определенную ссылку
request.open('GET', url)

// Что мы хотим получить
request.responseType = 'json' // xml, text

request.send()  // отправка запроса

// Как мы будет обрабатывать ответ
// Когда произойдет загрузка данных мы выполним определенную ф
request.onload = function() {
  // переменная в которую хотим сложить ответ
  const data = request.response // получаем ответ в виде JSON
  // Выводим ответ в консоль
  console.log(data)
}

